Repository: pybricks/pybricks-api
Catalog: doc/locales/*/LC_MESSAGES/index.po
Languages: de

source: Table of contents
de: Inhaltsverzeichnis

source: Pybricks modules
de: Pybricks-Module

source: Code with blocks
de: Code mit Blöcken

source: MicroPython modules
de: MicroPython-Module

source: Pybricks Documentation
de: Pybricks-Dokumentation

source: `Pybricks <https://pybricks.com/>`_ is Python coding for smart LEGO® hubs. Run MicroPython scripts directly on the hub, and get full control of your motors and sensors.
de: `Pybricks <https://pybricks.com/>`_ ist Python-Programmierung für intelligente LEGO® Hubs. Führen Sie MicroPython-Skripte direkt auf dem Hub aus und erhalten Sie volle Kontrolle über Ihre Motoren und Sensoren.

source: Pybricks runs on LEGO® BOOST, City, Technic, MINDSTORMS®, and SPIKE®. You can code using Windows, Mac, Linux, Chromebook, and Android.
de: Pybricks läuft auf LEGO® BOOST, City, Technic, MINDSTORMS® und SPIKE®. Sie können mit Windows, Mac, Linux, Chromebook und Android programmieren.

source: Click on any device below to see its documentation. Use the menu on the left to find documentation for additional modules. You may need to click the ☰ icon above to reveal this menu.
de: Klicken Sie unten auf ein Gerät, um dessen Dokumentation anzuzeigen. Verwenden Sie das Menü auf der linken Seite, um die Dokumentation für zusätzliche Module zu finden. Möglicherweise müssen Sie auf das ☰-Symbol oben klicken, um dieses Menü anzuzeigen.

source: You are viewing the stand-alone version of the documentation. To learn more about Pybricks and to start coding, visit the `Pybricks website`_
de: Sie sehen die eigenständige Version der Dokumentation. Um mehr über Pybricks zu erfahren und mit dem Programmieren zu beginnen, besuchen Sie die `Pybricks-Website`_

source: Are you using LEGO MINDSTORMS EV3? Check out the `EV3 documentation`_ instead.
de: Verwenden Sie LEGO MINDSTORMS EV3? Schauen Sie stattdessen in die `EV3-Dokumentation`_.

source: Programmable hubs
de: Programmierbare Hubs

source: Powered Up motors and sensors
de: Powered Up Motoren und Sensoren
